In [1]:
import pandas as pd

In [2]:
# Creating a DataFrame from a dictionary
data = {'Name': ['John', 'Alice', 'Bob'],
        'Age': [25, 28, 22],
        'City': ['New York', 'San Francisco', 'Seattle']}
 
df = pd.DataFrame(data)

In [3]:
df

    Name  Age           City
0   John   25       New York
1  Alice   28  San Francisco
2    Bob   22        Seattle

In [4]:
names = df['Name']
names

0     John
1    Alice
2      Bob
Name: Name, dtype: object

In [5]:
# Slicing rows
subset = df[1:3]
subset

    Name  Age           City
1  Alice   28  San Francisco
2    Bob   22        Seattle

In [6]:
# Adding a new column
df['Salary'] = [50000, 60000, 70000]
df

    Name  Age           City  Salary
0   John   25       New York   50000
1  Alice   28  San Francisco   60000
2    Bob   22        Seattle   70000

In [7]:
# Filtering rows
youngsters = df[df['Age'] < 25]
youngsters

  Name  Age     City  Salary
2  Bob   22  Seattle   70000

In [8]:
# Creating a Series from a list
ages = pd.Series([25, 28, 22], name='Age')
ages

0    25
1    28
2    22
Name: Age, dtype: int64

In [9]:
# Accessing elements by index
first_age = ages[0]
first_age

25

In [10]:
# Applying a function to each element
ages_in_months = ages.apply(lambda x: x * 12)
ages_in_months

0    300
1    336
2    264
Name: Age, dtype: int64

In [11]:
df["test"] = ages_in_months
df

    Name  Age           City  Salary  test
0   John   25       New York   50000   300
1  Alice   28  San Francisco   60000   336
2    Bob   22        Seattle   70000   264